DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Base_TS_T40D2M10I6R0/include/Adc_MemMap.h
#ifdef ADC_STOP_SEC_VAR_INIT_32_NO_CACHEABLE
    #ifdef INSIDE_ADC_START_SEC_VAR_INIT_32_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_VAR_INIT_32_NO_CACHEABLE
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_VAR_INIT_32_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma DATA_SEG DEFAULT
#endif

#ifdef ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    #define INSIDE_ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma DATA_SEG mcal_data
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    #ifdef INSIDE_ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_VAR_INIT_UNSPECIFIED_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma DATA_SEG DEFAULT
#endif
/**************************************************************************************************/
/********************************************* COSMIC *********************************************/
/**************************************************************************************************/
#elif defined(_COSMIC_C_S32K1xx_)
/**************************************** ADC *******************************/
#ifdef ADC_START_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_8
    #define INSIDE_ADC_START_SEC_CONFIG_DATA_8
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_8
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma section const {mcalconstcfg}
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_8
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_8
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma section const {}
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_16
    #define INSIDE_ADC_START_SEC_CONFIG_DATA_16
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_16
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma section const {mcalconstcfg}
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_16
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_16
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma section const {}
#endif

