DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Base_TS_T40D2M10I6R0/include/Adc_MemMap.h
#ifdef ADC_STOP_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_8
        #undef ENTERED_ADC_START_SEC_CONFIG_DATA_8
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_16
    #define ENTERED_ADC_START_SEC_CONFIG_DATA_16
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_16
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_16
        #undef ENTERED_ADC_START_SEC_CONFIG_DATA_16
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_32
    #define ENTERED_ADC_START_SEC_CONFIG_DATA_32
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_32
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_32
        #undef ENTERED_ADC_START_SEC_CONFIG_DATA_32
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata 
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #define ENTERED_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
        #undef ENTERED_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata 
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_8_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_8_NO_CACHEABLE
    #define ENTERED_ADC_START_SEC_CONFIG_DATA_8_NO_CACHEABLE
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_8_NO_CACHEABLE
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const_no_cacheable" 
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_8_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONFIG_DATA_8_NO_CACHEABLE
        #undef ENTERED_ADC_START_SEC_CONFIG_DATA_8_NO_CACHEABLE
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONFIG_DATA_8_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16_NO_CACHEABLE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_16_NO_CACHEABLE
    #define ENTERED_ADC_START_SEC_CONFIG_DATA_16_NO_CACHEABLE
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_16_NO_CACHEABLE
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const_no_cacheable" 
#endif

