DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Base_TS_T40D2M10I6R0/include/Adc_MemMap.h
#ifdef ADC_STOP_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONST_16
        #undef ENTERED_ADC_START_SEC_CONST_16
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONST_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_32
    #define ENTERED_ADC_START_SEC_CONST_32
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONST_32
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const" 
#endif

#ifdef ADC_STOP_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONST_32
        #undef ENTERED_ADC_START_SEC_CONST_32
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONST_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONST_UNSPECIFIED
    #define ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONST_UNSPECIFIED
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata ".mcal_const" 
#endif

#ifdef ADC_STOP_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
        #undef ENTERED_ADC_START_SEC_CONST_UNSPECIFIED
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CONST_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section rodata
#endif

#ifdef ADC_START_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CODE
    #define ENTERED_ADC_START_SEC_CODE
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CODE
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text ".mcal_text" 
#endif

#ifdef ADC_STOP_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_CODE
        #undef ENTERED_ADC_START_SEC_CODE
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text
#endif

#ifdef ADC_START_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_RAMCODE
    #define ENTERED_ADC_START_SEC_RAMCODE
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_RAMCODE
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text ".ramcode" 
#endif

#ifdef ADC_STOP_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #ifdef ENTERED_ADC_START_SEC_RAMCODE
        #undef ENTERED_ADC_START_SEC_RAMCODE
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_RAMCODE
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text
#endif

