DDDSZY/S32K1X_MCAL_DEMO/S32K148_MCAL_DEMO/MCAL/Base_TS_T40D2M10I6R0/include/Adc_MemMap.h
#ifdef ADC_STOP_SEC_CONFIG_DATA_8
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_8
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_8
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    /* no definition -> default compiler settings are used */
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_16
    #define INSIDE_ADC_START_SEC_CONFIG_DATA_16
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_16
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    #pragma arm section rodata=".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_16
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_16
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_16
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    /* no definition -> default compiler settings are used */
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_32
    #define INSIDE_ADC_START_SEC_CONFIG_DATA_32
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_32
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    #pragma arm section rodata=".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_32
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_32
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_32
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    /* no definition -> default compiler settings are used */
#endif

#ifdef ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #define INSIDE_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    #pragma arm section rodata=".mcal_const_cfg"
#endif

#ifdef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    #ifdef INSIDE_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef INSIDE_ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
        #undef MEMMAP_MATCH_ERROR
    #endif
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
    #undef ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    * @violates @ref Adc_MemMap_h_REF_1 MISRA 2004 Required Rule 19.6, use of '#undef' is discouraged
    */
     #undef MEMMAP_ERROR
    /* no definition -> default compiler settings are used */
#endif

